import MasonryGrid from "@/components/Biography/MasonaryGrid";
import { type Metadata } from "next";
import Image from "next/image";

export const metadata: Metadata = {
  title: "بیوگرافی",
  description: "بیوگرافی",
};

const images = [
  {
    src: "https://mane-haghighi-bucket.storage.c2.liara.space/biography/People%2001.jpg",
    alt: "Image 1",
  },
  {
    src: "https://mane-haghighi-bucket.storage.c2.liara.space/biography/People%2003.jpg",
    alt: "Image 2",
  },
  {
    src: "https://mane-haghighi-bucket.storage.c2.liara.space/biography/People%2004.jpg",
    alt: "Image 3",
  },
  {
    src: "https://mane-haghighi-bucket.storage.c2.liara.space/biography/People%2005.jpg",
    alt: "Image 4",
  },
  {
    src: "https://mane-haghighi-bucket.storage.c2.liara.space/biography/People%2006.jpg",
    alt: "Image 5",
  },
  {
    src: "https://mane-haghighi-bucket.storage.c2.liara.space/biography/People%2007.jpg",
    alt: "Image 6",
  },
];

export default function BiographyPage() {
  return (
    <main className="container mx-auto">
      <section className="container px-4 py-6 text-lg leading-7 shadow-lg my-6">
        <Image
          width={1000}
          height={300}
          src={
            "https://mane-haghighi-bucket.storage.c2.liara.space/biography/site-banner.jpg"
          }
          alt={"Banner"}
          className="w-full aspect-video object-cover rounded-lg mb-8"
        />
        <h1 className="text-center text-6xl font-bold">
          من فراز قورچیان هستم...
        </h1>
        <p className="mt-6">
          من روانشناس نیستم، عارف هم نیستم، من از ۶ الی ۷ سالگی تقریبا تمام
          زندگیم را صرف شناخت بنیادی و ریشه‌ای تمام رویدادها و اتفاقات مختلف
          زندگیم کردم. از بچگی جنگ ستارگان نگاه می‌کردم و علاقه‌ام به فیلم‌های
          فلسفی و تاریخی بود. پدرم خطاط بود، به من و خواهرانم هر روز درس حافظ
          خوانی و قرآن و خطاطی می‌داد و برامون کتاب‌های “بیشتر به من بگو چرا”
          می‌خرید. معمولا لا‌به‌لای این کتاب‌ها بزرگ شدم. همیشه ذهن پرسشگر و
          خیلی کنجکاوی داشتم. همیشه دوست داشتم بدونم آیا انسان‌ها دارای قدرت
          خارق‌ العاده‌ای هستند یا نه؟ همیشه دنیارو شبیه به یک جشن بزرگ می‌دیدم
          تا تقریبا ۱۵ الی ۱۶ سالگی، که فهمیدم اشتباه بزرگی کردم.
        </p>
        <br />
        <br />
        <p>
          از ۱۴ سالگیم وارد بازار کار شدم. تو بازار لاله زار تهران یکی از
          اقواممون وارد کننده فیوزهای برق بود. تابستون‌ها کار می‌کردم، تراشکاری،
          اداره بازیافت، حسابداری و … بقیه سال هم درس می‌خوندم. تو مدرسه‌های
          خیلی خوبی درس خوندم و درس ریاضی و ادبیات رو خیلی دوست داشتم. مدرسه
          ارشاد در مقطع دبیرستان و مدرسه دکتر محمد افشار، من رو آبستن یادگیری و
          فرهنگ کردن. بعد از اون، یه دوره تاریکی خیلی بزرگ رو تجربه کردم تا
          اینکه یه روز تو شهریور ماه تصمیم گرفتم یه کار بزرگ واسه زندگیم انجام
          بدم و دوباره برگشتم به درس و کار و …
        </p>
        <br />
        <br />
        <p>
          این دفعه در دانشگاه رشته مهندسی شهرسازی رو شروع کردم و به طور جدی وارد
          بازار کار شدم. هم باید هزینه‌های خودم رو پرداخت می‌کردم و هم هزینه‌های
          رفت و آمدم به دانشگاه که یک شهر دیگه بود، خیلی زیاد شده بود. دوتا شغل
          داشتم، هم کار پخش لوازم جانبی موبایل انجام می‌دادم و هم تولیدی کیف‌های
          لپ‌تاپ رو داشتم.
        </p>
        <br />
        <br />
        <p>
          تو محله‌ای که زندگی می‌کردم یکی بود بهش می‌گفتیم دکتر. هر روز میومد
          پیشمون با هم تحلیل فیلم و کتاب می‌کردیم، کتاب‌های یونگ و ویکتور فرانکل
          رو می‌خوندیم. نوزده سالم بود که وارد یه سری کلاس‌ها و دوره‌هایی برای
          کسب مهارت‌های فردی شدم. یه مشاور روانشناسی داشتم که اون موقع هر سی
          دقیقه ۳۰ هزار تومان هزینه خدماتش بود، چلوکباب پرسی ۵ هزار تومان بود .
          . . .
        </p>
        <br />
        <br />
        <p>
          منم تو بازار خوب کار می‌کردم و تقریبا هفته‌ای ۳ ساعت پیش ایشون
          می‌رفتم. به خاطر مشاوره‌های خوب درمانگرم راهم رو دقیق پیدا کردم؛
          روانشناسی نبود ولی به روانشناسی نزدیک بود.
        </p>
        <br />
        <br />
        <p>
          می‌رفتم کلاس‌های دی اس ام و لکان خوانی و… اما برام جذابیت نداشت و
          تصمیم گرفتم مقاله بنویسم. اون موقع مدیریت مجله برای هر مقاله بهم ۶۰
          هزار تومن می‌داد و منم مقاله‌ها رو به اسم من حقیقی منتشر می‌کردم.
          موقعی که می‌خواستم این بیزینس رو شروع کنم، تصمیم گرفتم اسمش رو بزارم
          من حقیقی چون می‌دیدم آدم‌های دور و اطرافم همه معمولا ماسک می‌زنن و هیچ
          کدوم خود حقیقیشون نیستن.
        </p>
        <br />
        <br />
        <p>
          اینجا یعنی من حقیقی را واقعا برای کسب درآمد یا کمک به مردم تاسیس
          نکردم؛ اینجا را اوایل تاسیس کردم که پاتوقی باشه برای مباحث و رفع
          سؤالاتم و سپس اینجا تبدیل شد به مکانی برای خدمت به صدها هزار نفر از
          مردم. توی دنیا معمولاً وقتی حرف‌های درستی می‌زنی و از منابع درست حرف
          می‌زنی و صدها هزار نفر هم به واسطه خدمات تو زندگیشون نجات پیدا می‌کنه،
          ازت تقدیر و تشکر می‌کنن؛ اما خب اینجا، اوضاع فرق داشت.
        </p>
        <br />
        <br />
        <p>
          هرچقدر سطح خدماتیم بیشتر می‌شد ازم مدارک تحصیلی بیشتر و مجوزهای بیشتر
          ی می‌خواستن و من هم باید می‌رفتم و مدارک تحصیلی را تقسیم می‌کردم.
          نمیدونم چطوری بگم ولی احساس می‌کنم تا ۲۵ شهریور ۱۴۰۲ برای اثبات حرف‌ها
          و کارهام همه کار کردم ولی همیشه شرایط اونطوری که میخوای پیش نمیره.
        </p>
        <br />
        <br />
        <p>
          بعد از ۶۱ دوره برگزاری کارگاه شفای زخم، مجبور شدیم به دلایلی اون رو
          متوقف کنیم؛ اما همون اتفاقات تلخ باعث رشد من و من حقیقی بود. بعد از
          متوقف کردن کارگاه شفای زخم، روی خودم و مسیرم خیلی کار کردم. به طوری که
          هر روز مردم بیشتری ما رو به هم معرفی می‌کردن، و اون‌ها هم به کسان
          دیگه‌ای که می‌شناختن، ما رو معرفی می کردند. این‌ها تمام کسانی هستند که
          از ما نتیجه مثبت گرفته‌اند‌.
        </p>
        <br />
        <br />
        <p>
          تا به امروز به لطف خدا و شما تونستیم به صدها هزار نفر از مردم کشورمان
          خدمت موثر برسونیم و رضایت حداکثریِ بالای %۹۵ از مخاطبینمان را دارا
          باشیم. قراره به کمک خداوند جهانی شویم و خدمات به خصوصی رو به سرتاسر
          دنیا ارائه بدیم که مثلش وجود ندارد.
        </p>
      </section>
      <section>
        <h2 className="mt-12 text-center text-3xl font-bold">سوالات جنجالی</h2>
        <video
          src="https://mane-haghighi-bucket.storage.c2.liara.space/assets/questions-biography.mp4"
          className="mt-4 w-full rounded-lg"
          controls
        />
      </section>

      <section className="mt-12">
        <h2 className="text-center text-3xl font-bold">
          تصاویری دوره ها و کارگاه های برگزار شده
        </h2>
        <MasonryGrid items={images} />
      </section>
    </main>
  );
}
